# <center>Pandas Python Library for Beginners in Data Science
#### <center>Instructor: Vinita Silaparasetty

### Import Libraries

In [1]:
import numpy as np
import pandas as pd

# <center> Creating a Series

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/series.png?raw=true" width="600" height="600">

### <center> Method 1: Using an Array

In [3]:
s =([1, np.nan, 'Pandas Library '])
s1 = pd.Series(s)
s1

0                  1
1                NaN
2    Pandas Library
dtype: object

## <center>🏆 Challenge

Create a Pandas Series, named s2, containing the following:

* Integer = 2

* Nan value

* Character = b

In [9]:
s2 = np.array([2, np.nan, 'b'])
s2 = pd.Series(s2)
s2

0      2
1    nan
2      b
dtype: object

### <center> Method 2: Using a List

In [10]:
list1 = ['animal', '2', 'animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

## <center>🏆 Challenge

Create a Pandas Series, named s4.
Use a list, named list2, containing the following:

* Integer = 3

* Character = c

* String = Numpy 

Note:'N' Must be capital

In [11]:
list2 = ['3', 'c', 'Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

### <center> Method 3: Using a Dictionary

In [13]:
s5 = pd.Series(
    {'A' : 1,
    '3' : 'Python'})
s5

A         1
3    Python
dtype: object

## <center>🏆 Challenge

Create a Pandas Series, named s6, containing the following:

* 'Integer' = 3
* 'B' = Boys

In [16]:
s6 = pd.Series(
    {'Integer' : 3,
     'B': 'Boys'})
s6

Integer       3
B          Boys
dtype: object

# <center> Creating Data Frames

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/dataframe.gif?raw=true" width="600" height="600">

### <center> Method 1: Passing a Numpy Array

In [17]:
df = pd.DataFrame(np.random.randn(6,4))
df

          0         1         2         3
0  1.356748  1.560549 -2.264286 -1.071121
1 -0.005858  0.210546  0.173714 -1.223633
2  0.141808  0.181524  0.768537 -0.149039
3 -0.421587  0.378398 -0.450985 -0.218752
4 -0.292066  0.687782  1.740308 -0.160229
5 -0.398942  0.515557 -0.481510  0.815129

## <center>🏆 Challenge

Create a data frame, named df1, which contains:

* A randomly generated array with the dimensions 3x3.

In [18]:
df1 = pd.DataFrame(np.random.randn(3,3))
df1

          0         1         2
0  0.833103 -1.186890 -0.584643
1 -1.136677  1.796605 -1.135650
2 -0.465978  0.414881  0.499690

### <center> Method 2: Passing a Dictionary of Objects

In [19]:
df2 = pd.DataFrame({
    'A':1,
    'number':np.array([6]*3, dtype='int32'),
})
df2

   A  number
0  1       6
1  1       6
2  1       6

## <center>🏆 Challenge

Create a data frame, named df3, which contains:

* 'E' = np.array([4] * 5,dtype='int32')

* 'Day' = 2

In [20]:
df3 = pd.DataFrame({
    'E' : np.array([4]*5, dtype='int32'),
    'Day': 2
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

--------

## <center> Importing Files

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

In [24]:
df4=pd.read_csv('/home/rhyme/Desktop/Project/practicedata.csv')
df4.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

-----------------

## <center>🏆 Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

In [28]:
df5=pd.read_json('/home/rhyme/Desktop/Project/practicedata.json')
df5.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

In [29]:
df6=pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
df6.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

## <center>🏆 Challenge
    
Create the data frame df7.

Then import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [31]:
df7=pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
df7.head(3)

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132

## <center> Export Files

### Export .csv Files

In [32]:
df4.to_csv('/home/rhyme/Desktop/Project/practicedata2.csv')

## <center>🏆 Challenge

Export the data from df4 to 'practicedata2.json'

Use the file path:/home/rhyme/Desktop/Project/

In [33]:
df4.to_json('/home/rhyme/Desktop/Project/practicedata2.json')

## <center>Data Summary
    
We will be working with data frame df6 for this section.

In [2]:
#first run this cell to create the data frame df6
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Quick Summary of Data

In [35]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 384.0 bytes

### Detailed Summary of Data

In [36]:
df6.describe()

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

## <center>View Columns

In [37]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>🏆 Challenge
    
View the columns in df7.

In [5]:
#first run this cell to create the data frame df7
df7 = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df7

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

In [39]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>View Datatypes

In [40]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>🏆 Challenge
    
View the datatypes in df7

In [41]:
df7.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>Handling Duplicates

### Detect Duplicate Rows

In [42]:
df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

### Drop Duplicate Rows

In [44]:
df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>🏆 Challenge
    
Detect and drop duplicates in df7

In [47]:
#Detect duplicates
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [48]:
#Drop duplicates
df7.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>Handling Missing Values

### Detect Missing Values

In [3]:
print(df6.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

### Drop Missing Values

In [4]:
df6.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>🏆 Challenge
    
Detect and drop missing values in df7

In [6]:
#Detect missing values
print(df7.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [7]:
#Drop missing values
df7.dropna()

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>Numeric Operations

We will work with the data frame df8.

In [8]:
#first run this cell to create the dataframe df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0  0.038132  0.902516 -0.987694 -1.912738
1  1.483074  0.929162 -2.026544 -0.922430
2  0.366751 -0.494292  0.183760  0.444305
3 -0.777906 -0.277398 -0.268977  0.273592
4 -1.039876 -0.203057  0.691247  0.958202
5 -1.146534 -0.252351 -1.035583  0.459315

### Calculate the Mean:

In [9]:
df8.mean()

0   -0.179393
1    0.100763
2   -0.573965
3   -0.116626
dtype: float64

## <center>🏆 Challenge
    
Calculate the mean of df9

In [10]:
#first run this cell to create df9
df9 = pd.DataFrame(np.random.randn(3,4))
df9

          0         1         2         3
0 -2.476591 -1.564461 -0.622562  0.739111
1 -0.963360 -0.138901  1.238439  1.781954
2  1.041035  1.190877  1.356018  0.659898

In [11]:
df9.mean()

0   -0.799638
1   -0.170828
2    0.657298
3    1.060321
dtype: float64

### Calculate the Cumulative Sum:

In [12]:
df8.apply(np.cumsum)

          0         1         2         3
0  0.038132  0.902516 -0.987694 -1.912738
1  1.521206  1.831678 -3.014238 -2.835168
2  1.887957  1.337386 -2.830478 -2.390863
3  1.110051  1.059988 -3.099455 -2.117270
4  0.070176  0.856930 -2.408208 -1.159068
5 -1.076358  0.604580 -3.443792 -0.699753

## <center>🏆 Challenge
    
Calculate the cumulative sum of df9

In [13]:
df9.apply(np.cumsum)

          0         1         2         3
0 -2.476591 -1.564461 -0.622562  0.739111
1 -3.439950 -1.703362  0.615877  2.521065
2 -2.398915 -0.512485  1.971895  3.180963

### Find the Maximum Value:

In [14]:
df8.max()

0    1.483074
1    0.929162
2    0.691247
3    0.958202
dtype: float64

## <center>🏆 Challenge

Find the maximum value of df9

In [15]:
df9.max()

0    1.041035
1    1.190877
2    1.356018
3    1.781954
dtype: float64

### Find the Minimum Value:

In [16]:
df8.min()

0   -1.146534
1   -0.494292
2   -2.026544
3   -1.912738
dtype: float64

## <center>🏆 Challenge

Find the minimum value of df9

In [17]:
df9.min()

0   -2.476591
1   -1.564461
2   -0.622562
3    0.659898
dtype: float64

## <center>String Manipulation

We will work with the series s7 for this section.

In [18]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

### Convert to Lower Case

In [19]:
s7.str.lower()

0               animal
1                 bird
2     pandas library
dtype: object

## <center>🏆 Challenge

Convert the strings in s8 to lower case.

In [20]:
#first run this cell to create series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8= pd.Series(s8)
s8

0                      cat
1                      dog
2     Python Programming
dtype: object

In [21]:
s8.str.lower()

0                      cat
1                      dog
2     python programming
dtype: object

---------------

### Convert to Upper Case

In [22]:
s7.str.upper()

0               ANIMAL
1                 BIRD
2     PANDAS LIBRARY
dtype: object

## <center>🏆 Challenge

Convert the strings in s8 to upper case.

In [23]:
s8.str.upper()

0                      CAT
1                      DOG
2     PYTHON PROGRAMMING
dtype: object

### Swap Capitalization

In [24]:
s7.str.swapcase()

0               ANIMAL
1                 BIRD
2     pANDAS lIBRARY
dtype: object

## <center>🏆 Challenge

Swap the capitalization of the strings in s8.

In [25]:
s8.str.swapcase()

0                      CAT
1                      DOG
2     pYTHON pROGRAMMING
dtype: object

### Find Length of String

In [26]:
s7.str.len()

0     6
1     4
2    17
dtype: int64

## <center>🏆 Challenge

Find the length of the strings in s8.

In [27]:
s8.str.len()

0     3
1     3
2    21
dtype: int64

-------------

### Split String

In [28]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

## <center>🏆 Challenge

Find the length of the strings in s8.

In [ ]:
#first run this cell to create the series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8= pd.Series(s8)
s8

In [29]:
s8.str.split()

0                    [cat]
1                    [dog]
2    [Python, Programming]
dtype: object

### Detect Unique Values

In [30]:
s7.unique()

array(['animal', 'bird', ' Pandas Library  '], dtype=object)

## <center>🏆 Challenge

Detect unique values in s8.

In [31]:
s8.unique()

array(['cat', 'dog', ' Python Programming  '], dtype=object)

### Repeat String

We will work with the series s7 for this section.

In [32]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

In [34]:
repeat_list=[2, 3, 2]
s7.str.repeat(repeat_list)

0                          animalanimal
1                          birdbirdbird
2     Pandas Library   Pandas Library
dtype: object

## <center>🏆 Challenge

Repeat the values in s8 in the order [1,2,3]

In [ ]:
## <center>🏆 Challenge

Repeat the values in s8 in the order [1,2,3]

In [35]:
repeat_list = [1, 2, 3]
s8.str.repeat(repeat_list)

0                                                  cat
1                                               dogdog
2     Python Programming   Python Programming   Pyt...
dtype: object